Revit 2024 API
DirectShapeType.UserAssignability Property
 An option controlling the ability of DirectShapes to assign this DirectShapeType as its type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public DirectShapeTypeUserAssignability UserAssignability { get; set; }
Visual Basic
Public Property UserAssignability As DirectShapeTypeUserAssignability
	Get
	Set
Visual C++
public:
property DirectShapeTypeUserAssignability UserAssignability {
	DirectShapeTypeUserAssignability get ();
	void set (DirectShapeTypeUserAssignability value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace